{"_id":{"$oid":"632241c2a2ee7c5bbbbde4f0"},"Name":"Peter Jackson","Bio":"Sir Peter Jackson made history with The Lord of the Rings trilogy, becoming the first person to direct three major feature films simultaneously. The Fellowship of the Ring, The Two Towers and The Return of the King were nominated for and collected a slew of awards from around the globe, with The Return of the King receiving his most impressive collection of awards. This included three Academy Awards® (Best Adapted Screenplay, Best Director and Best Picture), two Golden Globes (Best Director and Best Motion Picture-Drama), three BAFTAs (Best Adapted Screenplay, Best Film and Viewers' Choice), a Directors Guild Award, a Producers Guild Award and a New York Film Critics Circle Award.","Birth":"1961-10-31","Death":""}
{"_id":{"$oid":"632241d4a2ee7c5bbbbde4f1"},"Name":"George Lucas","Bio":"George Walton Lucas, Jr. was raised on a walnut ranch in Modesto, California. His father was a stationery store owner and he had three siblings. During his late teen years, he went to Thomas Downey High School and was very much interested in drag racing. He planned to become a professional racecar driver. However, a terrible car accident just after his high school graduation ended that dream permanently. The accident changed his views on life.","Birth":"1944-05-14","Death":""}
{"_id":{"$oid":"632241d4a2ee7c5bbbbde4f2"},"Name":"Ridley Scott","Bio":"Described by film producer Michael Deeley as the very best eye in the business, director Ridley Scott was born on November 30, 1937 in South Shields, Tyne and Wear. His father was an officer in the Royal Engineers and the family followed him as his career posted him throughout the United Kingdom and Europe before they eventually returned to Teesside. Scott wanted to join the Royal Army (his elder brother Frank had already joined the Merchant Navy) but his father encouraged him to develop his artistic talents instead and so he went to West Hartlepool College of Art and then London's Royal College of Art where he helped found the film department.","Birth":"1937-11-30","Death":""}
{"_id":{"$oid":"632241daa2ee7c5bbbbde4f3"},"Name":"Christopher Nolan","Bio":"A new bio for Chrstopher Nolan","Birth":"1970-07-30","Death":""}
{"_id":{"$oid":"63224207a2ee7c5bbbbde4f4"},"Name":"Joss Wheldon","Bio":"Joss Whedon is the middle of five brothers - his younger brothers are Jed Whedon and Zack Whedon. Both his father, Tom Whedon and his grandfather, John Whedon were successful television writers. Joss' mother, Lee Stearns, was a history teacher and she also wrote novels as Lee Whedon. Whedon was raised in New York and was educated at Riverdale Country School, where his mother also taught. He also attended Winchester College in England for two years, before graduating with a film degree from Wesleyan University.","Birth":"1964-06-23","Death":""}
{"_id":{"$oid":"63224212a2ee7c5bbbbde4f5"},"Name":"Wolfgang Peterson","Bio":"A controversial film maker, Wolfgang Petersen has at once been lauded for his professionalism and attention to detail and decried for turning out a string of standard commercial Hollywood blockbusters. The son of a naval officer, Petersen held a lifelong fascination with the sea and naval subjects. He was born in Emden and attended drama school in Hamburg. Having already made some 8 mm films while at school, he proceeded to direct as well as act at the Junges Theater in Hamburg (later renamed the Ernst-Deutsch-Theater). In 1966, he joined the newly formed Deutsche Film- und Fernsehakademie Berlin (DFFB) where he made several short films while simultaneously directing plays in Hamburg. Having caught the eye of German television networks, Petersen went on to direct a string of TV movies which often dealt with such contentious issues as environmental pollution and underage sex. An early success and also his first cinematic release was the taut psychological thriller One or the Other (1974), which starred Jürgen Prochnow and Elke Sommer. This led to more regular assignments on the ever-popular detective series Tatort (1970) for which Petersen directed six episodes.","Birth":"1941-03-14","Death":"2022-08-12"}
